IDEA StatiCa Open Model
ReinfBarInclined Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Representing reinforcement inclined bar in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.Reinforcement
 IdeaRS.OpenModel.Detail.ReinforcementGroup
 IdeaRS.OpenModel.Detail.ReinfBarInclined
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ReinfBarInclined : ReinforcementGroup
Public Class ReinfBarInclined
	Inherits ReinforcementGroup
public ref class ReinfBarInclined : public ReinforcementGroup
The ReinfBarInclined type exposes the following members.
Constructors
Name | Description
ReinfBarInclined
 Constructor
Top
Properties
Name | Description
AddBarOnBottom
 Add bar on Bottom - possible only for FullLength
AddBarOnTop
 Add bar on top - possible only for FullLength
Angle
 Angle between bar and master edge
BottomLength
 Length of additional bar on the bottom
Cover
 Cover of reinforcement
 (Inherited from ReinforcementGroup.)
CoverFromSetting
 Use cover from DetailModelSetting
 (Inherited from ReinforcementGroup.)
Diameter
 Diameter o reinforcement
 (Inherited from ReinforcementGroup.)
DiameterOfMandrel
 Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars
 (Inherited from ReinforcementGroup.)
EndsTypeBeg
 End type of the beginning of reinforcement bar
 (Inherited from ReinforcementGroup.)
EndsTypeEnd
 End type of the end of reinforcement bar
 (Inherited from ReinforcementGroup.)
Id
 Element Id
 (Inherited from OpenElementId.)
InclinedReinfBarType
 Type of inclined reinf bar
MasterComponent
 Master component of reinforcement
MasterEdge
 Master edge of reinforcement - edge from which is measured angle
MasterPoint
 Master point of reinforcement
Material
 Material
 (Inherited from Reinforcement.)
NumOfBarsInLayer
 Number of bars in layer
 (Inherited from ReinforcementGroup.)
ReinfId
 Id representing reinforcement in Detail
 (Inherited from Reinforcement.)
TopLength
 Length of additional bar on the top
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace